waiting_words: list[str] = ["Погружаемся в детали вашего образа...",
                            "Исследуем ваш внешний вид, будьте на связи...",
                            "Изучаем вашу фотографию, остался один штрих...",
                            "Разбираем каждую деталь, почти готово...",
                            "Сканируем ваш стиль, финальная проверка...",
                            "Подготовка рекомендаций в процессе, осталось немного...",
                            "Проводим глубинный анализ вашего образа...",
                            "Почти готовы с рекомендациями, последний штрих...",
                            "Финишная обработка вашего фото, финал близок..."]
